hybridCentralSolvers/Tutorials/Covolume/Sod/Test1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.01 -0.01)
    (1 -0.01 -0.01)
    (1 0.01 -0.01)
    (0 0.01 -0.01)
    (0 -0.01 0.01)
    (1 -0.01 0.01)
    (1 0.01 0.01)
    (0 0.01 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (800 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (0 4 7 3)
        );
    }
    empty1
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    empty2
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (5 6 7 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
